/**
 * +++++++++++++++++++++++++++++++++++
 * 加密和加密偏移量（用于AES加密解密使用）
 * +++++++++++++++++++++++++++++++++++
 * */
export const ENC_OFFSET = {
  key:"1234123412ABCDEF",//秘钥
  iv:"ABCDEF1234123412"//偏移量
}

/**
 * +++++++++++++++++++++++++++++++++++
 * 开启vconsole调试框（需要安装vconsole后）
 * +++++++++++++++++++++++++++++++++++
 * */
export const SHOW_VCONSOLE = true

/**
 * +++++++++++++++++++++++++++++++++++
 * 吐司提示延迟关闭时间
 * +++++++++++++++++++++++++++++++++++
 * */
export const TOAST_CLOSE_TIME = 3000

/**
 * +++++++++++++++++++++++++++++++++++
 * loading延迟关闭时间
 * +++++++++++++++++++++++++++++++++++
 * */
export const LOADING_CLOSE_TIME = 0
