//正则验证库
const validate = {
  //手机号码校验
  phoneNumber:/^1[3456789]\d{9}$/,
  //昵称校验
  nickName:/^[\u4E00-\u9FA5A-Za-z0-9_-]+$/,
  //校验QQ
  QQ:/^[1-9][0-9]{4,9}$/,
  //校验身份证号码
  idNumber: /^[1-9]\d{5}[1-9]\d{3}((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])\d{3}([0-9]|X|x)$/,
  //信用代码/注册号
  licence:/^[0-9a-zA-Z]{15,20}$/,
  //邮政编码
  postNumber:/^[1-9][0-9]{5}$/,
  //邮箱地址
  mail:/^[a-z0-9]+([._\\-]*[a-z0-9])*@([a-z0-9]+[-a-z0-9]*[a-z0-9]+.){1,63}[a-z0-9]+$/,
  //校验不能出现小数点
  notFlout: /^[0-9]\d*$/
};

export default validate;